In [1]:
import pandas as pd
import numpy as np

In [2]:
iprod={'Rice':{'Andhra P.':7452.4, 'Gujarat':1930.0, 'Kerela':2604.8, 'Punjab':11586.2,'Tripura':814.6,'Uttar P.':13754.0},
       'Wheat':{'Andhra P.':np.NaN, 'Gujarat':2737.0, 'Kerela':np.NaN, 'Punjab':16440.5,'Tripura':0.5,'Uttar P.':30056.0},
       'Pulses':{'Andhra P.':931.0, 'Gujarat':818.0, 'Kerela':1.7, 'Punjab':33.0,'Tripura':23.2,'Uttar P.':2184.4},
       'Fuits':{'Andhra P.':7830.0, 'Gujarat':11950.0, 'Kerela':113.1, 'Punjab':7152.0,'Tripura':44.1,'Uttar P.':140169.92}}
prodf=pd.DataFrame(iprod)
prodf

              Rice    Wheat  Pulses      Fuits
Andhra P.   7452.4      NaN   931.0    7830.00
Gujarat     1930.0   2737.0   818.0   11950.00
Kerela      2604.8      NaN     1.7     113.10
Punjab     11586.2  16440.5    33.0    7152.00
Tripura      814.6      0.5    23.2      44.10
Uttar P.   13754.0  30056.0  2184.4  140169.92

In [3]:
prodf.rename(columns={'Fuits':'Fruits'},inplace=True)

In [4]:
prodf

              Rice    Wheat  Pulses     Fruits
Andhra P.   7452.4      NaN   931.0    7830.00
Gujarat     1930.0   2737.0   818.0   11950.00
Kerela      2604.8      NaN     1.7     113.10
Punjab     11586.2  16440.5    33.0    7152.00
Tripura      814.6      0.5    23.2      44.10
Uttar P.   13754.0  30056.0  2184.4  140169.92

# Functions min( ) and max( )

df.min(axis= 0 or 1, skipna= True/False, numeric_only= True/False )

df.max(axis= 0 or 1, skipna= True/False, numeric_only= True/False )

axis= by default, min or max is calculated along axis 0 (i.e. for index(0), columns(1))

skipna= Excludes NA/Null/NaN values when computing the Result. By Default its 'True'.

numeric_only= Include only float,int,boolean columns for calculating min or max
If None, will attempt to use everything then use only numeric data.

You can skip 'skipna' and 'numeric_only' argumrnts, if yor DF mainly contains numeric data.

In [5]:
prodf.min()          # min value row-wise in each column

Rice      814.6
Wheat       0.5
Pulses      1.7
Fruits     44.1
dtype: float64

In [6]:
prodf.max()          # max value row-wise in an each column

Rice       13754.00
Wheat      30056.00
Pulses      2184.40
Fruits    140169.92
dtype: float64

In [7]:
prodf.min(axis=1)   # min value column-wise in each row

Andhra P.     931.0
Gujarat       818.0
Kerela          1.7
Punjab         33.0
Tripura         0.5
Uttar P.     2184.4
dtype: float64

In [8]:
prodf.max(axis=1)  # max value column-wise in each row

Andhra P.      7830.00
Gujarat       11950.00
Kerela         2604.80
Punjab        16440.50
Tripura         814.60
Uttar P.     140169.92
dtype: float64

In [9]:
prodf.idxmin()    # to get the index of min values in columns

Rice      Tripura
Wheat     Tripura
Pulses     Kerela
Fruits    Tripura
dtype: object

In [10]:
prodf.idxmax()    # to get the index of max values in columns

Rice      Uttar P.
Wheat     Uttar P.
Pulses    Uttar P.
Fruits    Uttar P.
dtype: object

In [11]:
prodf.max(axis=1,skipna=True,numeric_only=True)

Andhra P.      7830.00
Gujarat       11950.00
Kerela         2604.80
Punjab        16440.50
Tripura         814.60
Uttar P.     140169.92
dtype: float64

In [12]:
prodf.min(skipna=True,numeric_only=True)

Rice      814.6
Wheat       0.5
Pulses      1.7
Fruits     44.1
dtype: float64

# Mean, Median, Mode

df.mean(axis= 0 or 1, skipna= True/False, numeric_only= True/False )

df.median(axis= 0 or 1, skipna= True/False, numeric_only= True/False)

df.mode(axis= 0 or 1, numeric_only= True/False )     

Argument 'skipna' is not the part of mode()

mean() - Mean returns the computed avg. from a set of values for the requested axis.

median() - Median returns the middle number from a set of numbers.
           It returns the median value that seperates the higher half from the lower half of a set of values.
    
mode() - Mode returns the value that appears most often in a given set of values.

In [13]:
prodf.mean(axis= 0, skipna= True, numeric_only= True)

Rice       6357.000000
Wheat     12308.500000
Pulses      665.216667
Fruits    27876.520000
dtype: float64

In [14]:
prodf.mean(axis= 1, skipna= True, numeric_only= True)

Andhra P.     5404.466667
Gujarat       4358.750000
Kerela         906.533333
Punjab        8802.925000
Tripura        220.600000
Uttar P.     46541.080000
dtype: float64

In [15]:
prodf.mode(axis= 0, numeric_only= True)

      Rice    Wheat  Pulses     Fruits
0    814.6      0.5     1.7      44.10
1   1930.0   2737.0    23.2     113.10
2   2604.8  16440.5    33.0    7152.00
3   7452.4  30056.0   818.0    7830.00
4  11586.2      NaN   931.0   11950.00
5  13754.0      NaN  2184.4  140169.92

In [16]:
prodf.mode(axis= 1, numeric_only= True)

                0        1        2          3
Andhra P.   931.0   7452.4   7830.0        NaN
Gujarat     818.0   1930.0   2737.0   11950.00
Kerela        1.7    113.1   2604.8        NaN
Punjab       33.0   7152.0  11586.2   16440.50
Tripura       0.5     23.2     44.1     814.60
Uttar P.   2184.4  13754.0  30056.0  140169.92

In [17]:
prodf.median(axis= 0, skipna= True, numeric_only= True)

Rice      5028.60
Wheat     9588.75
Pulses     425.50
Fruits    7491.00
dtype: float64

In [18]:
prodf.median(axis= 1, skipna= True, numeric_only= True)

Andhra P.     7452.40
Gujarat       2333.50
Kerela         113.10
Punjab        9369.10
Tripura         33.65
Uttar P.     21905.00
dtype: float64

# count( ) and sum( )

counts the non-NaN entries for each row or column

df.count(axis= 0 or 1, numeric_only= True or False)

numeric_only = Include only float,int,boolean data. By default its value is 'False'.

df.sum(axis= 0 or 1, skipna= True or False, numeric_only= True or False, min_count= 0)

numeric_only = Include only float,int,boolean columns for calculating min or max
               If None (default), will attempt to use everything then use only numeric data.

skipna = Excludes NA/Null/NaN values when computing the Result. By Default its 'True'.

min_count = reqd. no. of valid values to perform the operation.By Default its '0' 
            If fewer the min_count non-NA values are present the result will be NA.
            If  value is '1', This means that sum or product of all-NA or empty series is NaN.

In [19]:
prodf.count()

Rice      6
Wheat     4
Pulses    6
Fruits    6
dtype: int64

In [20]:
prodf.count(axis=1)

Andhra P.    3
Gujarat      4
Kerela       3
Punjab       4
Tripura      4
Uttar P.     4
dtype: int64

In [21]:
prodf.count(axis=0, numeric_only=False)

Rice      6
Wheat     4
Pulses    6
Fruits    6
dtype: int64

In [22]:
prodf.sum()

Rice       38142.00
Wheat      49234.00
Pulses      3991.30
Fruits    167259.12
dtype: float64

In [23]:
prodf

              Rice    Wheat  Pulses     Fruits
Andhra P.   7452.4      NaN   931.0    7830.00
Gujarat     1930.0   2737.0   818.0   11950.00
Kerela      2604.8      NaN     1.7     113.10
Punjab     11586.2  16440.5    33.0    7152.00
Tripura      814.6      0.5    23.2      44.10
Uttar P.   13754.0  30056.0  2184.4  140169.92

In [24]:
prodf.sum(axis=0, skipna= True, numeric_only= True, min_count= 1)

Rice       38142.00
Wheat      49234.00
Pulses      3991.30
Fruits    167259.12
dtype: float64

In [25]:
prodf.sum(axis=1, skipna= True, numeric_only= True, min_count= 1)

Andhra P.     16213.40
Gujarat       17435.00
Kerela         2719.60
Punjab        35211.70
Tripura         882.40
Uttar P.     186164.32
dtype: float64

# quantile( )

Process of Dividing the total distribution of given Data into a given no of equal proportions.
The divided parts are called Quantiles.

Quartiles will have 4 Quantiles (4-equal distributions). Each having 25% share.

df.quantile(q=   , axis 0 or 1, numeric_only= True or False)

q = float or array-like , default 0.5 (50%) quantile.
    0<=q<=1
q = [0.25,0.5,0.75,1.0]

if q is an array , a DataFrame will be returned.
if q is a float, a series will be returned.

numeric_only= if false, the quantile of datetime and timedelta data will be computed as well.

In [26]:
import pandas as pd
import numpy as np
marks={1:{'Acct':99,'Eco':94, 'Eng':95, 'IP':94,'Math':97},
       2:{'Acct':94, 'Eco':94, 'Eng':89, 'IP':87,'Math':100},
       3:{'Acct':81, 'Eco':72, 'Eng':71, 'IP':79,'Math':65},
       4:{'Acct':70, 'Eco':67, 'Eng':69, 'IP':65,'Math':69},
       5:{'Acct':88, 'Eco':82, 'Eng':82, 'IP':89,'Math':86},
       6:{'Acct':90, 'Eco':81, 'Eng':79, 'IP':81,'Math':84},
       7:{'Acct':41, 'Eco':36, 'Eng':51, 'IP':42,'Math':40},
       8:{'Acct':61, 'Eco':54, 'Eng':60, 'IP':63,'Math':55},
       9:{'Acct':42, 'Eco':42, 'Eng':45, 'IP':43,'Math':40},
       10:{'Acct':68, 'Eco':67, 'Eng':66, 'IP':64,'Math':60}}
       
mks2=pd.DataFrame(marks)
mks2

      1    2   3   4   5   6   7   8   9   10
Acct  99   94  81  70  88  90  41  61  42  68
Eco   94   94  72  67  82  81  36  54  42  67
Eng   95   89  71  69  82  79  51  60  45  66
IP    94   87  79  65  89  81  42  63  43  64
Math  97  100  65  69  86  84  40  55  40  60

In [27]:
mks2.quantile([0.25,0.5,0.75,1.0], axis=1, numeric_only=True)

       Acct    Eco    Eng     IP    Math
0.25  62.75  57.25  61.50  63.25   56.25
0.50  75.50  69.50  70.00  72.00   67.00
0.75  89.50  81.75  81.25  85.50   85.50
1.00  99.00  94.00  95.00  94.00  100.00

In [28]:
mks2.quantile([0.25,0.5,0.75,1.0], axis=0, numeric_only=True)

        1      2     3     4     5     6     7     8     9     10
0.25  94.0   89.0  71.0  67.0  82.0  81.0  40.0  55.0  42.0  64.0
0.50  95.0   94.0  72.0  69.0  86.0  81.0  41.0  60.0  42.0  66.0
0.75  97.0   94.0  79.0  69.0  88.0  84.0  42.0  61.0  43.0  67.0
1.00  99.0  100.0  81.0  70.0  89.0  90.0  51.0  63.0  45.0  68.0

In [29]:
mks2.quantile([0.25,0.5,0.75,1.0], axis=0, numeric_only=False)

        1      2     3     4     5     6     7     8     9     10
0.25  94.0   89.0  71.0  67.0  82.0  81.0  40.0  55.0  42.0  64.0
0.50  95.0   94.0  72.0  69.0  86.0  81.0  41.0  60.0  42.0  66.0
0.75  97.0   94.0  79.0  69.0  88.0  84.0  42.0  61.0  43.0  67.0
1.00  99.0  100.0  81.0  70.0  89.0  90.0  51.0  63.0  45.0  68.0

# Standard Deviation std( )

std() function computes the standard deviation over requested axis.

df.std(axis= , skipna= None(By Default) ,numeric_only= None(By Default) )

In [30]:
mks2.std(axis=0, skipna=None ,numeric_only=None )

1     2.167948
2     5.069517
3     6.465292
4     2.000000
5     3.286335
6     4.301163
7     5.522681
8     3.911521
9     1.816590
10    3.162278
dtype: float64

In [31]:
mks2.std(axis=1, skipna=None ,numeric_only=None )

Acct    20.699973
Eco     20.063510
Eng     16.021167
IP      18.397162
Math    21.680508
dtype: float64

In [32]:
prodf.std(axis=0, skipna=None ,numeric_only=None )

Rice       5434.253848
Wheat     13846.150566
Pulses      854.872997
Fruits    55209.204865
dtype: float64

In [33]:
prodf.std(axis=1, skipna=None ,numeric_only=None )

Andhra P.     3878.733486
Gujarat       5121.617152
Kerela        1471.796434
Punjab        6969.368921
Tripura        396.400059
Uttar P.     63457.663624
dtype: float64

# Variance var( )

var() function computes variance and returns the unbiased variance over the requested axis.

df.var(axis= , skipna= None(By Default) ,numeric_only= None(By Default) )

In [34]:
prodf.var(axis=1, skipna=None ,numeric_only=None )

Andhra P.    1.504457e+07
Gujarat      2.623096e+07
Kerela       2.166185e+06
Punjab       4.857210e+07
Tripura      1.571330e+05
Uttar P.     4.026875e+09
dtype: float64

In [35]:
prodf.var(axis=0, skipna=None ,numeric_only=None )

Rice      2.953111e+07
Wheat     1.917159e+08
Pulses    7.308078e+05
Fruits    3.048056e+09
dtype: float64

# describe( )

All the Descriptive Statistics details can be calculated through a single function

df.describe()

In [36]:
prodf.describe()

               Rice         Wheat       Pulses         Fruits
count      6.000000      4.000000     6.000000       6.000000
mean    6357.000000  12308.500000   665.216667   27876.520000
std     5434.253848  13846.150566   854.872997   55209.204865
min      814.600000      0.500000     1.700000      44.100000
25%     2098.700000   2052.875000    25.650000    1872.825000
50%     5028.600000   9588.750000   425.500000    7491.000000
75%    10552.750000  19844.375000   902.750000   10920.000000
max    13754.000000  30056.000000  2184.400000  140169.920000

For String type column in DF, describe() gives different o/p for string column.

To get the o/p related to string column use: df.describe(include='all')  in the syntax

# Inspection Function info( )

In [37]:
prodf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, Andhra P. to Uttar P.
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Rice    6 non-null      float64
 1   Wheat   4 non-null      float64
 2   Pulses  6 non-null      float64
 3   Fruits  6 non-null      float64
dtypes: float64(4)
memory usage: 412.0+ bytes

In [38]:
mks2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Acct to Math
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   1       5 non-null      int64
 1   2       5 non-null      int64
 2   3       5 non-null      int64
 3   4       5 non-null      int64
 4   5       5 non-null      int64
 5   6       5 non-null      int64
 6   7       5 non-null      int64
 7   8       5 non-null      int64
 8   9       5 non-null      int64
 9   10      5 non-null      int64
dtypes: int64(10)
memory usage: 612.0+ bytes

# head( ) and tail( )

df.head(n=5)   top 5 listed rows

df.tail(n=3)   bottom 3 listed rows

In [39]:
mks2.head(n=5)

      1    2   3   4   5   6   7   8   9   10
Acct  99   94  81  70  88  90  41  61  42  68
Eco   94   94  72  67  82  81  36  54  42  67
Eng   95   89  71  69  82  79  51  60  45  66
IP    94   87  79  65  89  81  42  63  43  64
Math  97  100  65  69  86  84  40  55  40  60

In [40]:
prodf.tail(n=3)

             Rice    Wheat  Pulses     Fruits
Punjab    11586.2  16440.5    33.0    7152.00
Tripura     814.6      0.5    23.2      44.10
Uttar P.  13754.0  30056.0  2184.4  140169.92

# Cumulative Calculations Functions

cumsum() : Calculates cumulative sum value of each row, i.e. value of each row is replaced by sum of 
           all prior rows including this row. String value rows use concatenation. 
        
           df.cumsum([axis= rows/columns])   column-wise/row-wise cumulative sum calculated and displayed.
           
           By Default its column-wise i.e. [axis = 'rows']

cumprod() : gives cumulative product of values.
    
cummax()  : gives cumulative maximum of values.  
    
cummin()  : gives cumulative minimum of values.

In [41]:
mks2.cumsum(axis='columns')   # for each row-wise

      1    2    3    4    5    6    7    8    9    10
Acct  99  193  274  344  432  522  563  624  666  734
Eco   94  188  260  327  409  490  526  580  622  689
Eng   95  184  255  324  406  485  536  596  641  707
IP    94  181  260  325  414  495  537  600  643  707
Math  97  197  262  331  417  501  541  596  636  696

In [42]:
mks2.cumsum(axis='rows')    # for each column-wise

       1    2    3    4    5    6    7    8    9    10
Acct   99   94   81   70   88   90   41   61   42   68
Eco   193  188  153  137  170  171   77  115   84  135
Eng   288  277  224  206  252  250  128  175  129  201
IP    382  364  303  271  341  331  170  238  172  265
Math  479  464  368  340  427  415  210  293  212  325

In [43]:
mks2.cumprod()

,1,2,3,4,5,6,7,8,9,10
Acct,99,94,81,70,88,90,41,61,42,68
Eco,9306,8836,5832,4690,7216,7290,1476,3294,1764,4556
Eng,884070,786404,414072,323610,591712,575910,75276,197640,79380,300696
IP,83102580,68417148,32711688,21034650,52662368,46648710,3161592,12451320,3413340,19244544
Math,8060950260,6841714800,2126259720,1451390850,4528963648,3918491640,126463680,684822600,136533600,1154672640

In [44]:
mks2.cumprod(axis= 'columns')

,1,2,3,4,5,6,7,8,9,10
Acct,99,9306,753786,52765020,4643321760,417898958400,17133857294400,1045165294958400,43896942388252800,2984992082401190400
Eco,94,8836,636192,42624864,3495238848,283114346688,10192116480768,550374289961472,23115720178381824,1548753251951582208
Eng,95,8455,600305,41421045,3396525690,268325529510,13684602005010,821076120300600,36948425413527000,2438596077292782000
IP,94,8178,646062,41994030,3737468670,302734962270,12714868415340,801036710166420,34444578537156060,2204453026377987840
Math,97,9700,630500,43504500,3741387000,314276508000,12571060320000,691408317600000,27656332704000000,1659379962240000000

In [45]:
mks2

      1    2   3   4   5   6   7   8   9   10
Acct  99   94  81  70  88  90  41  61  42  68
Eco   94   94  72  67  82  81  36  54  42  67
Eng   95   89  71  69  82  79  51  60  45  66
IP    94   87  79  65  89  81  42  63  43  64
Math  97  100  65  69  86  84  40  55  40  60

In [46]:
mks2.cummax()

      1    2   3   4   5   6   7   8   9   10
Acct  99   94  81  70  88  90  41  61  42  68
Eco   99   94  81  70  88  90  41  61  42  68
Eng   99   94  81  70  88  90  51  61  45  68
IP    99   94  81  70  89  90  51  63  45  68
Math  99  100  81  70  89  90  51  63  45  68

In [47]:
mks2.cummax(axis= 'columns')

      1    2    3    4    5    6    7    8    9    10
Acct  99   99   99   99   99   99   99   99   99   99
Eco   94   94   94   94   94   94   94   94   94   94
Eng   95   95   95   95   95   95   95   95   95   95
IP    94   94   94   94   94   94   94   94   94   94
Math  97  100  100  100  100  100  100  100  100  100

In [48]:
mks2.cummin(axis= 'columns')

      1   2   3   4   5   6   7   8   9   10
Acct  99  94  81  70  70  70  41  41  41  41
Eco   94  94  72  67  67  67  36  36  36  36
Eng   95  89  71  69  69  69  51  51  45  45
IP    94  87  79  65  65  65  42  42  42  42
Math  97  97  65  65  65  65  40  40  40  40

# Applying Functions on a Sub-set of DataFrame

# (A) Applying Functions on a column of a DataFrame

df['Column_name'].func()     

Applying Functions on individual column of a DataFrame

In [49]:
prodf['Wheat'].count()

4

In [50]:
prodf['Fruits'].min()

44.1

# (B) Applying Functions on Multiple columns of a DataFrame

df[['Column_name','Column_name'......]].func()

In [51]:
prodf[['Wheat','Rice','Fruits']].count()

Wheat     4
Rice      6
Fruits    6
dtype: int64

# (C)Applying Functions on a Row of a DataFrame

df.loc['row_label',:].func() 

df.iloc['row_index',:].func()

In [52]:
prodf.loc['Andhra P.',:].median()

7452.4

In [53]:
prodf.iloc[3,:].max()

16440.5

# (D)Applying Functions on a Range of Rows of a DataFrame

df.loc['start_row_label':'end_row_label',:].func(axis=1)   

df.iloc['start_row_index':'end_row_index',:].func(axis=1)

In [54]:
prodf.loc['Gujarat':'Tripura',:].max(axis=1)

Gujarat    11950.0
Kerela      2604.8
Punjab     16440.5
Tripura      814.6
dtype: float64

In [55]:
prodf.loc['Gujarat':'Tripura',:].count(axis=1)

Gujarat    4
Kerela     3
Punjab     4
Tripura    4
dtype: int64

In [56]:
prodf.loc['Gujarat':'Tripura',:].mean(axis=1)

Gujarat    4358.750000
Kerela      906.533333
Punjab     8802.925000
Tripura     220.600000
dtype: float64

# (E) Applying functions to Subset of the DataFrame

df.loc['start_row_label':'end_row_label',:'start_column':'end_column'].func()

df.iloc['start_row_index':'end_row_index',:'start_column':'end_column'].func()

In [57]:
prodf.loc['Gujarat':'Tripura','Wheat':'Fruits'].count()

Wheat     3
Pulses    4
Fruits    4
dtype: int64

In [58]:
prodf.iloc[2:4,:].max(axis=1)

Kerela     2604.8
Punjab    16440.5
dtype: float64

In [59]:
prodf.iloc[1:5,:0:2].sum(axis=1)

Gujarat    0.0
Kerela     0.0
Punjab     0.0
Tripura    0.0
dtype: float64